Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_cpu.h
/**
 * @file pic18f_q84_cpu.h
 * @brief PIC18F27/47/57Q84 CPU core register definitions.
 *
 * This header defines all registers, bit masks, and bit positions for the
 * PIC18 enhanced CPU core found in the PIC18F-Q84 family.  Included are:
 *
 *   - STATUS register (ALU condition flags)
 *   - Interrupt control registers (INTCON0, INTCON1)
 *   - Bank Select Register (BSR)
 *   - Working register (WREG)
 *   - File Select Registers 0/1/2 and their indirect addressing modes
 *   - Program Counter (PCL, PCLATH, PCLATU)
 *   - Hardware stack pointer and Top-of-Stack (STKPTR, TOS)
 *   - Product register (PROD)
 *   - Table pointer and latch (TBLPTR, TABLAT)
 *   - Power control / reset cause (PCON0, PCON1)
 *   - CPU Doze / Idle control (CPUDOZE)
 *   - Fast-context-save shadow registers
 *
 * All addresses are absolute SFR addresses.  Multi-byte registers are
 * little-endian (low byte at the base address).
 *
 * Reference: Microchip DS40002213D - PIC18F27/47/57Q84 Data Sheet
 *
 * @note This file is included automatically by pic18f_q84.h.
 *       It relies on SFR8() and SFR16() macros defined there.
 */

#ifndef PIC18F_Q84_CPU_H
#define PIC18F_Q84_CPU_H

/* ============================================================================
 *  STATUS - ALU Status Register
 * ============================================================================
 *  Address: 0x04D7   (8-bit, read/write)
 *
 *  Contains the arithmetic condition flags set by the ALU after most
 *  instructions.  These flags drive conditional branch instructions
 *  (BZ, BNZ, BC, BNC, BN, BNN, BOV, BNOV).
 *
 *    Bit 7:5 - Reserved (read as 0)
 *    Bit 4   - N   Negative flag
 *    Bit 3   - OV  Overflow flag (signed arithmetic)
 *    Bit 2   - Z   Zero flag
 *    Bit 1   - DC  Digit Carry / borrow (BCD half-carry from bit 3 to bit 4)
 *    Bit 0   - C   Carry / borrow (carry out of the MSb)
 * ========================================================================= */

#define STATUS_ADDR 0x04D8u
#define STATUS SFR8(STATUS_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define STATUS_N_POS 4  /**< Negative flag bit position       */
#define STATUS_OV_POS 3 /**< Overflow flag bit position       */
#define STATUS_Z_POS 2  /**< Zero flag bit position           */
#define STATUS_DC_POS 1 /**< Digit Carry flag bit position    */
#define STATUS_C_POS 0  /**< Carry flag bit position          */

/* -- Bit masks ------------------------------------------------------------ */
#define STATUS_N (1u << STATUS_N_POS)   /**< 0x10 - Result of last ALU op was negative (signed)  */
#define STATUS_OV (1u << STATUS_OV_POS) /**< 0x08 - Signed overflow occurred                     */
#define STATUS_Z (1u << STATUS_Z_POS)   /**< 0x04 - Result was zero                              */
#define STATUS_DC (1u << STATUS_DC_POS) /**< 0x02 - Half-carry (bit 3->4), used for BCD arith    */
#define STATUS_C (1u << STATUS_C_POS)   /**< 0x01 - Carry out from MSb of result                 */

/* ============================================================================
 *  INTCON0 - Interrupt Control Register 0
 * ============================================================================
 *  Address: 0x04D5   (8-bit, read/write)
 *
 *  Controls global interrupt enables, external interrupt edge polarity,
 *  and the interrupt priority enable bit.
 *
 *    Bit 7   - GIE/GIEH   Global Interrupt Enable
 *                          (High-priority enable when IPEN = 1)
 *    Bit 6   - GIEL        Low-priority Global Interrupt Enable
 *                          (effective only when IPEN = 1)
 *    Bit 5:4 - Reserved
 *    Bit 3   - INT2EDG     External Interrupt 2 edge select
 *    Bit 2   - INT1EDG     External Interrupt 1 edge select
 *    Bit 1   - INT0EDG     External Interrupt 0 edge select
 *    Bit 0   - IPEN        Interrupt Priority Enable
 * ========================================================================= */

#define INTCON0_ADDR 0x04D7u
#define INTCON0 SFR8(INTCON0_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define INTCON0_GIE_POS 7     /**< Global Interrupt Enable (GIEH)   */
#define INTCON0_GIEH_POS 7    /**< Alias: high-priority GIE         */
#define INTCON0_GIEL_POS 6    /**< Low-priority interrupt enable    */
#define INTCON0_INT2EDG_POS 3 /**< INT2 edge select                 */
#define INTCON0_INT1EDG_POS 2 /**< INT1 edge select                 */
#define INTCON0_INT0EDG_POS 1 /**< INT0 edge select                 */
#define INTCON0_IPEN_POS 0    /**< Interrupt priority enable        */

/* -- Bit masks ------------------------------------------------------------ */
#define INTCON0_GIE (1u << INTCON0_GIE_POS)         /**< 0x80 - 1=interrupts enabled globally               */
#define INTCON0_GIEH (1u << INTCON0_GIEH_POS)       /**< 0x80 - Alias for GIE (high-priority when IPEN=1)   */
#define INTCON0_GIEL (1u << INTCON0_GIEL_POS)       /**< 0x40 - 1=low-priority interrupts enabled (IPEN=1)  */
#define INTCON0_INT2EDG (1u << INTCON0_INT2EDG_POS) /**< 0x08 - 1=INT2 triggers on rising edge              */
#define INTCON0_INT1EDG (1u << INTCON0_INT1EDG_POS) /**< 0x04 - 1=INT1 triggers on rising edge              */
#define INTCON0_INT0EDG (1u << INTCON0_INT0EDG_POS) /**< 0x02 - 1=INT0 triggers on rising edge              */
#define INTCON0_IPEN (1u << INTCON0_IPEN_POS)       /**< 0x01 - 1=priority levels enabled, 0=compat mode    */

/* ============================================================================
 *  INTCON1 - Interrupt Control Register 1
 * ============================================================================
 *  Address: 0x04D6   (8-bit, read-only)
 *
 *  Provides the current interrupt status: which priority level is being
 *  serviced.
 *
 *    Bit 7:2 - Reserved
 *    Bit 1:0 - STAT[1:0]  Current interrupt priority level being serviced
 * ========================================================================= */

#define INTCON1_ADDR 0x04D7u
#define INTCON1 SFR8(INTCON1_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define INTCON1_STAT1_POS 1 /**< Interrupt status bit 1           */
#define INTCON1_STAT0_POS 0 /**< Interrupt status bit 0           */

/* -- Bit masks ------------------------------------------------------------ */
#define INTCON1_STAT_MASK 0x03u                 /**< Both STAT bits                   */
#define INTCON1_STAT1 (1u << INTCON1_STAT1_POS) /**< 0x02        */
#define INTCON1_STAT0 (1u << INTCON1_STAT0_POS) /**< 0x01        */

/* ============================================================================
 *  BSR - Bank Select Register
 * ============================================================================
 *  Address: 0x04E0   (8-bit, read/write)
 *
 *  Selects the active General Purpose Register (GPR) bank for direct
 *  addressing.  The PIC18F-Q84 has 64 banks (0-63).
 *
 *    Bit 7:6 - Reserved (read as 0)
 *    Bit 5:0 - BSR[5:0]  Bank number (0-63)
 * ========================================================================= */

#define BSR_ADDR 0x04E0u
#define BSR SFR8(BSR_ADDR)

#define BSR_MASK 0x3Fu /**< Valid bank select bits [5:0]     */

/* ============================================================================
 *  WREG - Working Register
 * ============================================================================
 *  Address: 0x04E8   (8-bit, read/write)
 *
 *  The accumulator for the PIC18 ALU.  Most ALU instructions use WREG as
 *  an implicit source and/or destination operand.
 *
 *    Bit 7:0 - WREG[7:0]
 * ========================================================================= */

#define WREG_ADDR 0x04E8u
#define WREG SFR8(WREG_ADDR)

/* ============================================================================
 *  FSR0 - File Select Register 0  (16-bit indirect addressing pointer)
 * ============================================================================
 *  Addresses: FSR0L = 0x04E9, FSR0H = 0x04EA
 *
 *  FSR0 forms a 14-bit pointer (high byte bits 5:0 + low byte) used for
 *  indirect data memory access through INDF0, POSTINC0, POSTDEC0,
 *  PREINC0, and PLUSW0 virtual registers.
 *
 *    FSR0L  Bit 7:0 - Low byte of pointer
 *    FSR0H  Bit 5:0 - High byte of pointer (bits 13:8 of address)
 * ========================================================================= */

#define FSR0L_ADDR 0x04E9u
#define FSR0H_ADDR 0x04EAu
#define FSR0_ADDR FSR0L_ADDR /**< 16-bit base address     */

#define FSR0L SFR8(FSR0L_ADDR)
#define FSR0H SFR8(FSR0H_ADDR)
#define FSR0 SFR16(FSR0_ADDR) /**< 16-bit access to FSR0   */

#define FSR0H_MASK 0x3Fu /**< Valid high-byte bits [5:0]       */

/* ============================================================================
 *  FSR1 - File Select Register 1  (16-bit indirect addressing pointer)
 * ============================================================================
 *  Addresses: FSR1L = 0x04E1, FSR1H = 0x04E2
 *
 *  Same function as FSR0 but provides a second independent indirect
 *  addressing pointer.
 *
 *    FSR1L  Bit 7:0 - Low byte of pointer
 *    FSR1H  Bit 5:0 - High byte of pointer
 * ========================================================================= */

#define FSR1L_ADDR 0x04E1u
#define FSR1H_ADDR 0x04E2u
#define FSR1_ADDR FSR1L_ADDR

