Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_cpu.h
#define FSR1L SFR8(FSR1L_ADDR)
#define FSR1H SFR8(FSR1H_ADDR)
#define FSR1 SFR16(FSR1_ADDR)

#define FSR1H_MASK 0x3Fu /**< Valid high-byte bits [5:0]       */

/* ============================================================================
 *  FSR2 - File Select Register 2  (16-bit indirect addressing pointer)
 * ============================================================================
 *  Addresses: FSR2L = 0x04D9, FSR2H = 0x04DA
 *
 *  Third independent indirect addressing pointer.  Commonly used as a
 *  software frame/stack pointer by C compilers.
 *
 *    FSR2L  Bit 7:0 - Low byte of pointer
 *    FSR2H  Bit 5:0 - High byte of pointer
 * ========================================================================= */

#define FSR2L_ADDR 0x04D9u
#define FSR2H_ADDR 0x04DAu
#define FSR2_ADDR FSR2L_ADDR

#define FSR2L SFR8(FSR2L_ADDR)
#define FSR2H SFR8(FSR2H_ADDR)
#define FSR2 SFR16(FSR2_ADDR)

#define FSR2H_MASK 0x3Fu /**< Valid high-byte bits [5:0]       */

/* ============================================================================
 *  Indirect Addressing Virtual Registers
 * ============================================================================
 *  Each FSR (0/1/2) has five associated virtual registers that perform
 *  indirect memory access with optional pointer auto-modification:
 *
 *    INDFn    - Read/write using FSRn as-is (no modification)
 *    PLUSWn   - Read/write using FSRn + WREG (signed offset, no modify)
 *    PREINCn  - Increment FSRn first, then read/write through it
 *    POSTDECn - Read/write through FSRn, then decrement it
 *    POSTINCn - Read/write through FSRn, then increment it
 *
 *  These are not physical registers; they are hardware-decoded access
 *  modes.  Writing to or reading from the address triggers the FSR
 *  side-effect.
 * ========================================================================= */

/* -- FSR0 indirect modes -------------------------------------------------- */
#define PLUSW0_ADDR 0x04EBu   /**< FSR0 + WREG offset (no modify)  */
#define PREINC0_ADDR 0x04ECu  /**< ++FSR0, then indirect access     */
#define POSTDEC0_ADDR 0x04EDu /**< Indirect access, then FSR0--     */
#define POSTINC0_ADDR 0x04EEu /**< Indirect access, then FSR0++     */
#define INDF0_ADDR 0x04EFu    /**< Plain indirect via FSR0          */

#define PLUSW0 SFR8(PLUSW0_ADDR)
#define PREINC0 SFR8(PREINC0_ADDR)
#define POSTDEC0 SFR8(POSTDEC0_ADDR)
#define POSTINC0 SFR8(POSTINC0_ADDR)
#define INDF0 SFR8(INDF0_ADDR)

/* -- FSR1 indirect modes -------------------------------------------------- */
#define PLUSW1_ADDR 0x04E3u
#define PREINC1_ADDR 0x04E4u
#define POSTDEC1_ADDR 0x04E5u
#define POSTINC1_ADDR 0x04E6u
#define INDF1_ADDR 0x04E7u

#define PLUSW1 SFR8(PLUSW1_ADDR)
#define PREINC1 SFR8(PREINC1_ADDR)
#define POSTDEC1 SFR8(POSTDEC1_ADDR)
#define POSTINC1 SFR8(POSTINC1_ADDR)
#define INDF1 SFR8(INDF1_ADDR)

/* -- FSR2 indirect modes -------------------------------------------------- */
#define PLUSW2_ADDR 0x04DBu
#define PREINC2_ADDR 0x04DCu
#define POSTDEC2_ADDR 0x04DDu
#define POSTINC2_ADDR 0x04DEu
#define INDF2_ADDR 0x04DFu

#define PLUSW2 SFR8(PLUSW2_ADDR)
#define PREINC2 SFR8(PREINC2_ADDR)
#define POSTDEC2 SFR8(POSTDEC2_ADDR)
#define POSTINC2 SFR8(POSTINC2_ADDR)
#define INDF2 SFR8(INDF2_ADDR)

/* ============================================================================
 *  PCL / PCLATH / PCLATU - Program Counter
 * ============================================================================
 *  Addresses: PCL = 0x04F9, PCLATH = 0x04FA, PCLATU = 0x04FB
 *
 *  The PIC18 program counter is 21 bits wide (addressing up to 2M bytes
 *  of program memory).  PCL is the directly-readable low byte.  PCLATH
 *  and PCLATU are holding registers (latches):
 *
 *    - A write to PCL simultaneously loads PC[15:8] from PCLATH and
 *      PC[20:16] from PCLATU, performing an atomic 21-bit update.
 *    - A read of PCL simultaneously captures PC[15:8] into PCLATH and
 *      PC[20:16] into PCLATU.
 *
 *    PCL     Bit 7:0 - PC bits 7:0 (directly readable/writable)
 *    PCLATH  Bit 7:0 - Write buffer for PC bits 15:8
 *    PCLATU  Bit 4:0 - Write buffer for PC bits 20:16
 * ========================================================================= */

#define PCL_ADDR 0x04F9u
#define PCLATH_ADDR 0x04FAu
#define PCLATU_ADDR 0x04FBu

#define PCL SFR8(PCL_ADDR)
#define PCLATH SFR8(PCLATH_ADDR)
#define PCLATU SFR8(PCLATU_ADDR)

#define PCLATU_MASK 0x1Fu /**< Valid bits [4:0] of PCLATU       */

/* ============================================================================
 *  STKPTR - Hardware Stack Pointer
 * ============================================================================
 *  Address: 0x04FC   (8-bit, read/write)
 *
 *  Points to the current top-of-stack entry in the 128-deep hardware
 *  return address stack.  The stack is used automatically by CALL, RCALL,
 *  and RETURN/RETFIE instructions.  A value of 0 means the stack is
 *  empty; values 1-127 correspond to valid stack entries.
 *
 *    Bit 7   - Reserved
 *    Bit 6:0 - STKPTR[6:0]  Stack pointer value (0-127)
 * ========================================================================= */

#define STKPTR_ADDR 0x04FCu
#define STKPTR SFR8(STKPTR_ADDR)

#define STKPTR_MASK 0x7Fu /**< Valid stack pointer bits [6:0]   */

/* ============================================================================
 *  TOS - Top-of-Stack Registers
 * ============================================================================
 *  Addresses: TOSL = 0x04FD, TOSH = 0x04FE, TOSU = 0x04FF
 *
 *  Provides read/write access to the return address at the top of the
 *  hardware stack (the entry indicated by STKPTR).  This is a 21-bit
 *  program memory address broken into three bytes.
 *
 *    TOSL   Bit 7:0 - TOS bits 7:0  (PC low byte)
 *    TOSH   Bit 7:0 - TOS bits 15:8 (PC high byte)
 *    TOSU   Bit 4:0 - TOS bits 20:16 (PC upper bits)
 * ========================================================================= */

#define TOSL_ADDR 0x04FDu
#define TOSH_ADDR 0x04FEu
#define TOSU_ADDR 0x04FFu

#define TOSL SFR8(TOSL_ADDR)
#define TOSH SFR8(TOSH_ADDR)
#define TOSU SFR8(TOSU_ADDR)

#define TOSU_MASK 0x1Fu /**< Valid bits [4:0] of TOSU         */

/* ============================================================================
 *  PROD - Product Register  (16-bit)
 * ============================================================================
 *  Addresses: PRODL = 0x04F3, PRODH = 0x04F4
 *
 *  Holds the 16-bit result of the hardware MULTIPLY instruction.
 *  PRODL:PRODH = multiplier * multiplicand.
 *
 *    PRODL  Bit 7:0 - Product low byte (result bits 7:0)
 *    PRODH  Bit 7:0 - Product high byte (result bits 15:8)
 * ========================================================================= */

#define PRODL_ADDR 0x04F3u
#define PRODH_ADDR 0x04F4u
#define PROD_ADDR PRODL_ADDR /**< 16-bit base address     */

#define PRODL SFR8(PRODL_ADDR)
#define PRODH SFR8(PRODH_ADDR)
#define PROD SFR16(PROD_ADDR) /**< 16-bit access to PROD   */

/* ============================================================================
 *  TABLAT - Table Latch Register
 * ============================================================================
 *  Address: 0x04F5   (8-bit, read/write)
 *
 *  Holds the data byte transferred during table read (TBLRD) and table
 *  write (TBLWT) operations.  Table reads from program memory place the
 *  result here; table writes send the value from here to the write latch.
 *
 *    Bit 7:0 - Table latch data byte
 * ========================================================================= */

