Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_cpu.h
#define TABLAT_ADDR 0x04F5u
#define TABLAT SFR8(TABLAT_ADDR)

/* ============================================================================
 *  TBLPTR - Table Pointer  (21-bit, 3 bytes)
 * ============================================================================
 *  Addresses: TBLPTRL = 0x04F6, TBLPTRH = 0x04F7, TBLPTRU = 0x04F8
 *
 *  Points to the byte address in program memory for table read/write
 *  operations.  The full 22-bit address space allows access up to 4 MB,
 *  though the PIC18F-Q84 uses only 21 bits (2 MB max).
 *
 *    TBLPTRL  Bit 7:0 - Table pointer bits 7:0
 *    TBLPTRH  Bit 7:0 - Table pointer bits 15:8
 *    TBLPTRU  Bit 5   - TBLPTR21 (bit 21 of table pointer)
 *             Bit 4:0 - Table pointer bits 20:16
 * ========================================================================= */

#define TBLPTRL_ADDR 0x04F6u
#define TBLPTRH_ADDR 0x04F7u
#define TBLPTRU_ADDR 0x04F8u

#define TBLPTRL SFR8(TBLPTRL_ADDR)
#define TBLPTRH SFR8(TBLPTRH_ADDR)
#define TBLPTRU SFR8(TBLPTRU_ADDR)

/* -- TBLPTRU bit definitions ---------------------------------------------- */
#define TBLPTRU_TBLPTR21_POS 5                        /**< Bit 21 of table pointer          */
#define TBLPTRU_TBLPTR21 (1u << TBLPTRU_TBLPTR21_POS) /**< 0x20      */
#define TBLPTRU_MASK 0x3Fu                            /**< All valid bits [5:0]             */

/* ============================================================================
 *  PCON0 - Power Control Register 0  (Reset Cause Flags)
 * ============================================================================
 *  Address: 0x04F0   (8-bit, read/write)
 *
 *  Contains active-low flags that indicate the cause of the most recent
 *  device reset.  Each flag reads 0 when that reset source has occurred.
 *  Software must write 1 to clear (re-arm) a flag after reading it.
 *
 *    Bit 7 - STKOVF   Stack Overflow flag
 *                      0 = stack overflow occurred; 1 = no overflow
 *    Bit 6 - STKUNF   Stack Underflow flag
 *                      0 = stack underflow occurred; 1 = no underflow
 *    Bit 5 - Reserved
 *    Bit 4 - WDTWV    WDT Window Violation flag
 *                      0 = WDT cleared outside window; 1 = no violation
 *    Bit 3 - RWDT     Watchdog Timer Reset flag
 *                      0 = WDT timeout reset occurred; 1 = no WDT reset
 *    Bit 2 - RMCLR    MCLR Reset flag
 *                      0 = MCLR reset occurred; 1 = no MCLR reset
 *    Bit 1 - RI       RESET Instruction flag
 *                      0 = RESET instruction was executed; 1 = not executed
 *    Bit 0 - POR      Power-on Reset flag
 *                      0 = POR occurred; 1 = no POR
 * ========================================================================= */

#define PCON0_ADDR 0x04F0u
#define PCON0 SFR8(PCON0_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define PCON0_STKOVF_POS 7 /**< Stack overflow flag              */
#define PCON0_STKUNF_POS 6 /**< Stack underflow flag             */
#define PCON0_WDTWV_POS 4  /**< WDT window violation flag        */
#define PCON0_RWDT_POS 3   /**< WDT reset flag                   */
#define PCON0_RMCLR_POS 2  /**< MCLR reset flag                  */
#define PCON0_RI_POS 1     /**< RESET instruction flag           */
#define PCON0_POR_POS 0    /**< Power-on reset flag              */

/* -- Bit masks (all flags are active-low: 0 = event occurred) ------------- */
#define PCON0_STKOVF (1u << PCON0_STKOVF_POS) /**< 0x80 - 0=stack overflow occurred     */
#define PCON0_STKUNF (1u << PCON0_STKUNF_POS) /**< 0x40 - 0=stack underflow occurred    */
#define PCON0_WDTWV (1u << PCON0_WDTWV_POS)   /**< 0x10 - 0=WDT cleared outside window  */
#define PCON0_RWDT (1u << PCON0_RWDT_POS)     /**< 0x08 - 0=WDT timeout reset occurred  */
#define PCON0_RMCLR (1u << PCON0_RMCLR_POS)   /**< 0x04 - 0=MCLR reset occurred         */
#define PCON0_RI (1u << PCON0_RI_POS)         /**< 0x02 - 0=RESET instruction executed  */
#define PCON0_POR (1u << PCON0_POR_POS)       /**< 0x01 - 0=power-on reset occurred     */

/* ============================================================================
 *  PCON1 - Power Control Register 1
 * ============================================================================
 *  Address: 0x04F1   (8-bit, read/write)
 *
 *  Additional active-low reset cause flags.
 *
 *    Bit 7:2 - Reserved
 *    Bit 1   - MEMV    Memory Violation Reset flag
 *                       0 = illegal memory access caused reset; 1 = no violation
 *    Bit 0   - RVREG   Voltage Regulator Reset flag (LDO only)
 *                       0 = VREG brown-out reset occurred; 1 = no VREG reset
 * ========================================================================= */

#define PCON1_ADDR 0x04F1u
#define PCON1 SFR8(PCON1_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define PCON1_MEMV_POS 1  /**< Memory violation flag            */
#define PCON1_RVREG_POS 0 /**< Voltage regulator reset flag     */

/* -- Bit masks ------------------------------------------------------------ */
#define PCON1_MEMV (1u << PCON1_MEMV_POS)   /**< 0x02 - 0=memory violation reset occurred  */
#define PCON1_RVREG (1u << PCON1_RVREG_POS) /**< 0x01 - 0=VREG brown-out occurred (LDO)    */

/* ============================================================================
 *  CPUDOZE - CPU Doze/Idle Control Register
 * ============================================================================
 *  Address: 0x04F2   (8-bit, read/write)
 *
 *  Controls the CPU power-saving modes:
 *
 *    - Idle mode:  CPU halts, peripherals continue running.  Entry via
 *                  SLEEP instruction when IDLEN = 1.
 *    - Doze mode:  CPU runs at a reduced instruction rate while
 *                  peripherals continue at full speed.
 *
 *    Bit 7   - IDLEN  Idle Enable
 *                     1 = SLEEP instruction enters Idle mode
 *                     0 = SLEEP instruction enters full Sleep mode
 *    Bit 6   - DOZEN  Doze Enable
 *                     1 = CPU runs at doze ratio; peripherals at full speed
 *                     0 = CPU and peripherals at same speed
 *    Bit 5   - ROI    Recover on Interrupt
 *                     1 = Exit Doze/Idle on any interrupt
 *    Bit 4   - DOE    Doze on Exit
 *                     1 = Re-enter Doze mode after ISR returns
 *    Bit 3   - Reserved
 *    Bit 2:0 - DOZE[2:0]  Doze ratio (CPU instruction cycle divider)
 *                     000 = 1:2     (CPU runs at half speed)
 *                     001 = 1:4
 *                     010 = 1:8
 *                     011 = 1:16
 *                     100 = 1:32
 *                     101 = 1:64
 *                     110 = 1:128
 *                     111 = 1:256   (CPU runs at 1/256 speed)
 * ========================================================================= */

