Teivaz/boat-control-panel/firmware/pic18f_q84/pic18f_q84_cpu.h
#define CPUDOZE_ADDR 0x04F2u
#define CPUDOZE SFR8(CPUDOZE_ADDR)

/* -- Bit positions -------------------------------------------------------- */
#define CPUDOZE_IDLEN_POS 7 /**< Idle Enable                      */
#define CPUDOZE_DOZEN_POS 6 /**< Doze Enable                      */
#define CPUDOZE_ROI_POS 5   /**< Recover on Interrupt             */
#define CPUDOZE_DOE_POS 4   /**< Doze on Exit (re-enter after ISR)*/
#define CPUDOZE_DOZE_POS 0  /**< Doze ratio field base position   */

/* -- Bit masks ------------------------------------------------------------ */
#define CPUDOZE_IDLEN (1u << CPUDOZE_IDLEN_POS) /**< 0x80 - 1=Idle mode on SLEEP       */
#define CPUDOZE_DOZEN (1u << CPUDOZE_DOZEN_POS) /**< 0x40 - 1=Doze mode enabled        */
#define CPUDOZE_ROI (1u << CPUDOZE_ROI_POS)     /**< 0x20 - 1=recover from Doze on IRQ */
#define CPUDOZE_DOE (1u << CPUDOZE_DOE_POS)     /**< 0x10 - 1=re-enter Doze after ISR  */
#define CPUDOZE_DOZE_MASK 0x07u                 /**< Doze ratio bits [2:0]            */

/* -- Doze ratio field values ---------------------------------------------- */
#define CPUDOZE_DOZE_1_2 0x00u   /**< CPU at 1/2 speed                 */
#define CPUDOZE_DOZE_1_4 0x01u   /**< CPU at 1/4 speed                 */
#define CPUDOZE_DOZE_1_8 0x02u   /**< CPU at 1/8 speed                 */
#define CPUDOZE_DOZE_1_16 0x03u  /**< CPU at 1/16 speed                */
#define CPUDOZE_DOZE_1_32 0x04u  /**< CPU at 1/32 speed                */
#define CPUDOZE_DOZE_1_64 0x05u  /**< CPU at 1/64 speed                */
#define CPUDOZE_DOZE_1_128 0x06u /**< CPU at 1/128 speed               */
#define CPUDOZE_DOZE_1_256 0x07u /**< CPU at 1/256 speed               */

/* ============================================================================
 *  Fast-Context-Save Shadow Registers
 * ============================================================================
 *  The PIC18 CPU automatically saves STATUS, WREG, and BSR into shadow
 *  registers on high-priority interrupt entry and restores them on
 *  RETFIE FAST.  This provides single-cycle context save/restore without
 *  software overhead.
 *
 *  STATUS_SHAD, WREG_SHAD, BSR_SHAD:
 *      Written by hardware on interrupt entry.
 *      Read by hardware on RETFIE FAST.
 *      Also readable/writable by software.
 *
 *  PCLATH_SHAD, PCLATU_SHAD:
 *      Shadow copies of the PC latch registers.
 *
 *  FSR0_SHAD, FSR1_SHAD, FSR2_SHAD:
 *      Shadow copies of the three file select register pairs.
 *
 *  PROD_SHAD:
 *      Shadow copy of the product register pair.
 * ========================================================================= */

/* -- STATUS shadow -------------------------------------------------------- */
#define STATUS_SHAD_ADDR 0x0377u
#define STATUS_SHAD SFR8(STATUS_SHAD_ADDR) /**< Shadow of STATUS  */

/* -- WREG shadow ---------------------------------------------------------- */
#define WREG_SHAD_ADDR 0x0378u
#define WREG_SHAD SFR8(WREG_SHAD_ADDR) /**< Shadow of WREG    */

/* -- BSR shadow ----------------------------------------------------------- */
#define BSR_SHAD_ADDR 0x0379u
#define BSR_SHAD SFR8(BSR_SHAD_ADDR) /**< Shadow of BSR     */

/* -- PCLATH / PCLATU shadow ----------------------------------------------- */
#define PCLATH_SHAD_ADDR 0x037Bu
#define PCLATU_SHAD_ADDR 0x037Cu

#define PCLATH_SHAD SFR8(PCLATH_SHAD_ADDR) /**< Shadow of PCLATH  */
#define PCLATU_SHAD SFR8(PCLATU_SHAD_ADDR) /**< Shadow of PCLATU  */

/* -- FSR0 shadow ---------------------------------------------------------- */
#define FSR0L_SHAD_ADDR 0x037Du
#define FSR0H_SHAD_ADDR 0x037Eu
#define FSR0_SHAD_ADDR FSR0L_SHAD_ADDR

#define FSR0L_SHAD SFR8(FSR0L_SHAD_ADDR) /**< Shadow of FSR0L   */
#define FSR0H_SHAD SFR8(FSR0H_SHAD_ADDR) /**< Shadow of FSR0H   */
#define FSR0_SHAD SFR16(FSR0_SHAD_ADDR)  /**< 16-bit shadow     */

/* -- FSR1 shadow ---------------------------------------------------------- */
#define FSR1L_SHAD_ADDR 0x037Fu
#define FSR1H_SHAD_ADDR 0x0380u
#define FSR1_SHAD_ADDR FSR1L_SHAD_ADDR

#define FSR1L_SHAD SFR8(FSR1L_SHAD_ADDR) /**< Shadow of FSR1L   */
#define FSR1H_SHAD SFR8(FSR1H_SHAD_ADDR) /**< Shadow of FSR1H   */
#define FSR1_SHAD SFR16(FSR1_SHAD_ADDR)  /**< 16-bit shadow     */

/* -- FSR2 shadow ---------------------------------------------------------- */
#define FSR2L_SHAD_ADDR 0x0381u
#define FSR2H_SHAD_ADDR 0x0382u
#define FSR2_SHAD_ADDR FSR2L_SHAD_ADDR

#define FSR2L_SHAD SFR8(FSR2L_SHAD_ADDR) /**< Shadow of FSR2L   */
#define FSR2H_SHAD SFR8(FSR2H_SHAD_ADDR) /**< Shadow of FSR2H   */
#define FSR2_SHAD SFR16(FSR2_SHAD_ADDR)  /**< 16-bit shadow     */

/* -- PROD shadow ---------------------------------------------------------- */
#define PRODL_SHAD_ADDR 0x0383u
#define PRODH_SHAD_ADDR 0x0384u
#define PROD_SHAD_ADDR PRODL_SHAD_ADDR

#define PRODL_SHAD SFR8(PRODL_SHAD_ADDR) /**< Shadow of PRODL   */
#define PRODH_SHAD SFR8(PRODH_SHAD_ADDR) /**< Shadow of PRODH   */
#define PROD_SHAD SFR16(PROD_SHAD_ADDR)  /**< 16-bit shadow     */

/* ============================================================================
 *  Context-Save Shadow Registers  (Low-Priority Interrupt)
 * ============================================================================
 *  These registers provide a second shadow layer used for low-priority
 *  interrupt context saving when interrupt priority levels are enabled
 *  (IPEN = 1).
 * ========================================================================= */

#define STATUS_CSHAD_ADDR 0x0374u
#define STATUS_CSHAD SFR8(STATUS_CSHAD_ADDR) /**< Context shadow STATUS */

#define WREG_CSHAD_ADDR 0x0375u
#define WREG_CSHAD SFR8(WREG_CSHAD_ADDR) /**< Context shadow WREG   */

#define BSR_CSHAD_ADDR 0x0376u
#define BSR_CSHAD SFR8(BSR_CSHAD_ADDR) /**< Context shadow BSR    */

/* ============================================================================
 *  SHADCON - Shadow Register Control
 * ============================================================================
 *  Address: 0x0377   (8-bit, read/write)
 *
 *  Controls shadow register load behavior.  Shares address space with
 *  STATUS_SHAD; accessible as a distinct register by the hardware.
 *
 *    Bit 7:1 - Reserved
 *    Bit 0   - SHADLO  Shadow Load Override
 *                       1 = Force shadow registers to load from their
 *                           corresponding source registers
 *                       0 = Normal automatic operation
 * ========================================================================= */

#define SHADCON_ADDR 0x0377u
#define SHADCON SFR8(SHADCON_ADDR)

#define SHADCON_SHADLO_POS 0                      /**< Shadow Load Override bit         */
#define SHADCON_SHADLO (1u << SHADCON_SHADLO_POS) /**< 0x01          */

#endif /* PIC18F_Q84_CPU_H */
